Tekla.Structures.Analysis.AnalysisRestraintData.SupportedEnum
Defines how the part is supported.

Tekla.Structures.Analysis.AnalysisRestraintData.SupportedEnum.CONNECTED
The part is connected.

Tekla.Structures.Analysis.AnalysisRestraintData.SupportedEnum.SUPPORTED
The part is supported.